# IsObjectTaggedAsPart

## Description
Determine if the specified sub-object is tagged as a part.

```pascal
FUNCTION IsObjectTaggedAsPart(objectHandle : HANDLE) : BOOLEAN;
```

```python

def vs.IsObjectTaggedAsPart(objectHandle):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectHandle|HANDLE|The sub-object handle.|

## Returns
Return TRUE if the specified sub-object is tagged as a part.

## See Also
VS Functions:
TagSubObjectAsPart

## Version
Availability: from Vectorworks 2022
## Category
* Objects - Custom